skillfair/app/controllers/products_controller.rb

INSERT INTO "products" ("name", "image_url", "created_at", "updated_at") VALUES ('Shaper Origin Handheld CNC', 'https://stemfinity.com/cdn/shop/files/Shaper_Origin_LifestyleImage_8.jpg', '2025-05-22 21:19:56.545410', '2025-05-22 21:19:56.545410') RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 5 LIMIT 1
---
    def set_product
      @product = Product.find(params.expect(:id))